# Давай представим, что мы пишем бэкенд для сайта ветеринарной клиники. Нам нужно написать программу, 
# которая будет запрашивать у пользователя вид питомца, его возраст и кличку, а потом выведет все эти данные в одно предложение. 
pitom = str(input("введите вид питомца")).
vozr = str(input("введите возраст питомца")).
klich = str(input("введите кличку питомца")).
print(f"Это {pitom} по кличке {klich}.Возраст: {vozr}").


